[{
  "tag": "P",
  "text": "About the Author: Advanced analytics professional and management consultant helping companies find solutions for diverse problems through a mix of business, technology, and math on organisational data. A Data Science enthusiast, here to share, learn and contribute; You can connect with me on Linked;",
  "translation": "作者简介：高级分析专家和管理顾问，通过结合组织数据的业务，技术和数学，帮助公司找到各种问题的解决方案。 数据科学爱好者，在这里分享，学习和贡献； 您可以通过链接与我联系；"
}, {
  "tag": "H1",
  "text": "How bad will the Coronavirus Outbreak get? — Predicting the outbreak figures",
  "translation": "冠状病毒爆发有多严重？ -预测爆发数字"
}, {
  "tag": "H2",
  "text": "A Data Analyst’s perspective — 4 Key things you should know",
  "translation": "数据分析师的观点-您应该知道的4件事"
}, {
  "tag": "P",
  "text": "“Everyone in China and elsewhere who are suffering, may God strengthen the victims and their families and guide them through this tough time. Please follow the advice outlined in the WHO website to stay safe and protected”",
  "translation": "“中国和其他地方的每个遭受苦难的人，愿上帝使受害者及其家属得到加强，并指导他们度过这个艰难的时期。 请遵循WHO网站上概述的建议，以确保安全和受到保护”"
}, {
  "tag": "H1",
  "text": "Where do we stand today?",
  "translation": "我们今天站在哪里？"
}, {
  "tag": "P",
  "text": "The outbreak continues to spread — As of Feb 1st, the WHO has confirmed around 12,000 cases, and more than 2,000 alone was confirmed on Saturday (That’s roughly 18% of the total reported cases). A total of 48 provinces across 28 countries have been affected. However, only a little more than 2% of these cases were found outside China. Although this number might seem small, Wuhan, the city at the center of the outbreak, is a major transportation hub of the country. Inter-city travels increasing because of the Lunar New year has aided the outbreak to some extent. During Oct-Nov last year, close to 2 million people flew out of Wuhan and roughly 120 thousand people flew outside the country as well. Hence the outbreak of Coronavirus remains a major concern across the globe."
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/freeze/max/30/1*R9eKEf8V1FH065hJ4APUHw.gif?q=20",
  "caption": "Countries impacted — As of Report till Jan 31, 2020 (Credit — Developed by the Author using Excel 3D Map)",
  "type": "image",
  "file": "1!R9eKEf8V1FH065hJ4APUHw.gif"
}, {
  "tag": "H1",
  "text": "How Contagious is the Virus?",
  "translation": "病毒的传染性如何？"
}, {
  "tag": "P",
  "text": "The pace and ease at which any outbreak spreads, determine its scale. The Report published by the Imperial College of London suggests that a person suffering from Coronavirus can affect 1.5 to 3.5 healthy people. According to the New York Times, if 5 people with new coronavirus can impact 2.6 others, then 5 people could be sick after 1 Cycle, 18 people after 2 Cycles, 52 people after 3 Cycles and so on.",
  "translation": "爆发的速度和难易程度决定了爆发的规模。 伦敦帝国学院发布的报告表明，患有冠状病毒的人可以影响1.5至3.5个健康人。 根据《纽约时报》的报道，如果5名新冠状病毒感染者可以感染2.6人，那么1个周期后5人可能生病，2个周期后18人，3个周期后52人，依此类推。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/freeze/max/30/1*GJRzmj61J4DX0zuHD-JJmQ.gif?q=20",
  "caption": "How can a Coronavirus out-spread from 5 to 368 people in 5 Cycles (Credit: The New York Times)",
  "type": "image",
  "file": "1!GJRzmj61J4DX0zuHD-JJmQ.gif"
}, {
  "tag": "H1",
  "text": "How bad is the Outbreak in China?",
  "translation": "中国的疫情有多严重？"
}, {
  "tag": "H2",
  "text": "Data vs the World Health Organization Debate!",
  "translation": "数据与世界卫生组织辩论！"
}, {
  "tag": "P",
  "text": "I worked on creating a QlikSense base dashboard to monitor the current scenario and track the outbreak. You can find more about it below.",
  "translation": "我致力于创建QlikSense基本仪表板，以监视当前情况并跟踪疫情。 您可以在下面找到更多有关它的信息。"
}, {
  "tag": "H2",
  "text": "Novel coronavirus (2019-nCoV) — WHO’s new interactive, web-based online training for coronavirus…",
  "translation": "新型冠状病毒（2019-nCoV）-世卫组织基于Web的新型交互式在线在线培训……"
}, {
  "tag": "H3",
  "text": "WHO’s online training is currently the best weapon to fight the coronavirus outbreak; Covers methods for detection…",
  "translation": "世卫组织的在线培训是目前对抗冠状病毒爆发的最佳武器； 涵盖检测方法..."
}, {
  "tag": "H2",
  "text": "Time Series Forecasting vs. The Data Sense Prediction Debate! — What Industry Demands?",
  "translation": "时间序列预测与数据感知预测辩论！ —行业需求是什么？"
}, {
  "tag": "H3",
  "text": "How I achieved a MAPE of 1.4% while predicting the Coronavirus outbreak;"
}, {
  "tag": "H2",
  "text": "How bad will the Coronavirus Outbreak get? — The Outbreak — Hypothesis Analysis",
  "translation": "冠状病毒爆发有多严重？ -爆发-假设分析"
}, {
  "tag": "H3",
  "text": "A Data Analyst’s perspective on the current situation",
  "translation": "数据分析师对当前情况的看法"
}, {
  "tag": "H2",
  "text": "Why Quality & Sense checks are so important in Data Science?",
  "translation": "为什么质量和意识检查在数据科学中如此重要？"
}, {
  "tag": "H3",
  "text": "How the World Health Organization and the 2019-nCoV (Coronavirus) database from Kaggle tells the same story with…",
  "translation": "世界卫生组织和Kaggle的2019-nCoV（冠状病毒）数据库如何用...讲述相同的故事..."
}, {
  "tag": "P",
  "text": "As of Saturday, the WHO has confirmed 11,821 cases in China. However, figures collated by the Johns Hopkins University suggest a much higher number. A probability that some of the cases are FALSE POSITIVES exists, i.e. someone was incorrectly suspected of having the virus but were cleared off when tested. The average growth in the number of cases reported in China remains as high as 16.3% (higher than SARS cases in 2003)."
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/freeze/max/30/1*zswCcEmJh7w2uxBh_FHpjg.gif?q=20",
  "caption": "State/Provinces impacted in China (Credit — Developed by the Author using Excel 3D Map)",
  "type": "image",
  "file": "1!zswCcEmJh7w2uxBh_FHpjg.gif"
}, {
  "tag": "H1",
  "text": "A look into the future — Number of Confirmed Cases will rise to over 38,000 by the end of next week!",
  "translation": "展望未来-到下周底，确认病例数将超过38,000！"
}, {
  "tag": "P",
  "text": "It is difficult to predict the outbreak using a time series model, given we don’t have enough data points. Let’s take a look at the growth rate in confirmed cases over time. Three key parameters need to be considered when looking into a time-dependent variable.",
  "translation": "鉴于我们没有足够的数据点，因此很难使用时间序列模型预测疫情。 让我们来看看随着时间的推移确诊病例的增长率。 调查时间相关变量时，需要考虑三个关键参数。"
}, {
  "tag": "UL",
  "texts": ["Trend — Is there a linear increase in the magnitude of the variable over time? e.g. Does growth in confirmed cases increase with time?", "Level — What is the average value of the variable over a period of time? e.g. What is the average growth figure in the last 6 days?", "Seasonality — Do we see a similar pattern in values across specific intervals? — Do we observe similar trends on Specific days, higher confirmed cases/growth figures every Monday?"],
  "translations": ["趋势-变量的大小是否随时间线性增加？ 例如 确诊病例的增长是否随时间增加？", "级别-一段时间内变量的平均值是多少？ 例如 最近6天内的平均增长率是多少？", "季节性-在特定时间间隔内，我们是否看到类似的价值模式？ —在特定的日子，我们是否观察到类似的趋势，每个星期一的确诊病例/增长数字更高？"]
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*BTJ4-U21lHcKbwS_1Z02Jg.png?q=20",
  "caption": "Data Source: WHO Situation Report",
  "type": "image",
  "file": "1!BTJ4-U21lHcKbwS_1Z02Jg.png"
}, {
  "tag": "P",
  "text": "Assumptions and Insights",
  "translation": "假设与见解"
}, {
  "tag": "UL",
  "texts": ["Assumption — Outbreaks will continue to grow since the initial volume of confirmed cases is low, we can only look at figures after the growth rates have stabled out. Else numbers might get skewed", "Lack of Seasonality in growth figures of confirmed cases. Feasible because of fewer data points; However growth rates have started declining owing to a larger volume of Confirmed Cases", "A combination of previous day value, alpha, and previous growth rate can be used to predict the outcome for the next 7 days; where alpha is the average of the change in growth rates over time"],
  "translations": ["假设-由于确诊病例的初始数量很少，疫情将继续增长，我们只能看看增长率稳定之后的数字。 其他数字可能会出现偏差", "确诊病例的增长数字缺乏季节性。 因为数据点少，所以可行； 但是，由于确诊病例数量增加，增长率开始下降", "前一天的值，alpha和以前的增长率的组合可用于预测接下来7天的结果； α是随时间变化的增长率的平均值"]
}, {
  "tag": "P",
  "text": "Forecast",
  "translation": "预测"
}, {
  "tag": "P",
  "text": "Using total confirmed cases from the previous day and applying an alpha (-2.9%) of recent growth rate, I predicted the outbreak for the next week. The forecast was validated using WHO Situation Report 12 & Report 13, and a MAPE of 1% is observed. Taking a look at the Graph suggests that I ended up over predicting the figures."
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*8INeuopY0zI7S0vbwBGmPA.png?q=20",
  "caption": "Forecast",
  "type": "image",
  "file": "1!8INeuopY0zI7S0vbwBGmPA.png"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*27_WxXUK62sppgDBIH_f-g.png?q=20",
  "caption": "Forecast. Data Source — WHO Situation Report",
  "type": "image",
  "file": "1!27_WxXUK62sppgDBIH_f-g.png"
}, {
  "tag": "H2",
  "text": "Could ARIMA (Auto-regressive Integrated Moving Average) have given better results?",
  "translation": "ARIMA（自回归综合移动平均线）能否给出更好的结果？"
}, {
  "tag": "P",
  "text": "A time series is a sequence where a metric is recorded over regular time intervals. Depending on the frequency, a time series can be of yearly, monthly, weekly or even daily. Since the number of confirmed cases is a time-dependent variable technique like Single or Double Exponential Smoothing or an ARIMA can yield a better forecast. However, I didn’t try it owing to fewer data points. Any time series model requires enough data points to understand the interaction between the current and previous set of values. However, I used the partial autocorrelation (PACF) plot to validate if my assumptions were correct or not.",
  "translation": "时间序列是在定期的时间间隔内记录度量的序列。 根据频率，时间序列可以是每年，每月，每周甚至每天。 由于确诊病例的数量是随时间变化的可变技术，例如单指数或双指数平滑或ARIMA可以产生更好的预测。 但是，由于数据点较少，我没有尝试过。 任何时间序列模型都需要足够的数据点来理解当前值和先前值集之间的相互作用。 但是，我使用偏自相关（PACF）图来验证我的假设是否正确。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/0*7cuukz2f1mIiKj9w.png?q=20",
  "type": "image",
  "file": "0!7cuukz2f1mIiKj9w.png"
}, {
  "tag": "P",
  "text": "I am going to write more about this in my next article, however, if you wish to learn more, visit this site. Using PACF I figured out the following:",
  "translation": "我将在下一篇文章中写更多有关此内容的信息，但是，如果您想了解更多信息，请访问此站点。 使用PACF，我得出以下结论："
}, {
  "tag": "UL",
  "texts": ["PACF can be imagined as the correlation between the series and its lag, after excluding the contributions from the intermediate lags. Since the PACF is higher than the significant value for Lag 1 only, it suggests that a pure correlation exists between say total Confirmed cases today and day before, and not any other instances (hence I can use current value to predict the next one)"],
  "translations": ["排除中间滞后的贡献后，可以将PACF想象为系列与其滞后之间的相关性。 由于PACF仅高于滞后1的显着值，因此它表明在今天和前一天的总确诊病例之间存在纯粹的相关性，而在其他任何情况下都不存在（因此我可以使用当前值来预测下一个）"]
}, {
  "tag": "PRE",
  "text": "(本文翻译自Angel Das的文章《How bad will the Coronavirus Outbreak get? — Predicting the outbreak figures》，参考：https://towardsdatascience.com/how-bad-will-the-coronavirus-outbreak-get-predicting-the-outbreak-figures-f0b8e8b61991)",
  "translation": "（本文翻译自Angel Das的文章《冠状病毒爆发有多严重？—预测爆发数字》，参考：https：//towardsdatascience.com/how-bad-will-the-coronavirus-outbreak-get-predicting- 爆发数字f0b8e8b61991）"
}]