[{
  "tag": "P",
  "text": "About the author:",
  "translation": "关于作者："
}, {
  "tag": "P",
  "text": "Ravi Rajan is a global IT program manager based out of Mumbai, India. He is also an avid blogger, Haiku poetry writer, archaeology enthusiast, and history maniac. Connect with Ravi on LinkedIn, Medium and Twitter.",
  "translation": "Ravi Rajan是位于印度孟买的全球IT计划经理。 他还是一位狂热的博客作者，Hai句诗作家，考古爱好者和历史狂人。 在LinkedIn，Medium和Twitter上与Ravi联系。"
}, {
  "tag": "H1",
  "text": "Communicate, Communicate and Communicate.",
  "translation": "交流，交流和交流。"
}, {
  "tag": "P",
  "text": "Communication. It’s about honesty. It’s about treating people in the organization as deserving to know the facts. You don’t try to give them half the story. You don’t try to hide the story. You treat them as…as true equals, and you communicate and communicate and communicate.",
  "translation": "通讯。 关于诚实。 这是关于将组织中的人员视为应了解事实。 您不要试图给他们一半的故事。 您不会试图隐藏故事。 您将它们视为……是平等的，并且彼此沟通，相互交流。"
}, {
  "tag": "P",
  "text": "If you have important information to share with your boss, colleagues, vendors — even if it’s not great news — don’t wait. If you put off providing them with actionable information until it’s too late to act, then your news will never be well received, whether it’s good or bad.",
  "translation": "如果您有重要的信息要与老板，同事，供应商共享，即使这不是个好消息，也不要等待。 如果您推迟为他们提供可行的信息，直到为时已晚，那么无论您的消息是好是坏，都将永远不会收到您的消息。"
}, {
  "tag": "P",
  "text": "In almost every conceivable scenario, it’s to your advantage to communicate as quickly as possible, allowing everyone involved to understand and digest the information, formulate an appropriate reaction, and respond accordingly. If it is bad news, your early warning just might allow for sufficient planning to minimize the damage.",
  "translation": "在几乎每种可能的情况下，尽早进行通信对您都是有好处的，它使每个参与人员都能理解和消化信息，做出适当的反应并做出相应的反应。 如果是坏消息，则您的早期预警可能会允许进行充分的计划以最大程度地减少损害。"
}, {
  "tag": "P",
  "text": "Above all, remain professional, polite, direct, and clear. Remember, Professionalism: it’s NOT the job you DO, it’s HOW you DO the job. As a developer, you need to do your best work even if circumstances are not favoring it. That is your forte; your unique selling point, your indomitable attitude and never dilute it what so ever.",
  "translation": "最重要的是，保持专业，礼貌，直接和清晰。 请记住，专业精神：这不是您要做的工作，而是您如何做的工作。 作为开发人员，即使情况不利，您也需要尽力而为。 那是你的长处； 您独特的卖点，顽强的态度，再也不会稀释它。"
}, {
  "tag": "P",
  "text": "As John Maxwell has rightly said.",
  "translation": "正如约翰·麦克斯韦（John Maxwell）正确说的。"
}, {
  "tag": "P",
  "text": "“We choose what attitudes we have right now. And it’s a continuing choice.”",
  "translation": "“我们选择我们现在所拥有的态度。 这是一个持续的选择。”"
}, {
  "tag": "H1",
  "text": "Decide to Have a Growth Mindset.",
  "translation": "决定有一个成长心态。"
}, {
  "tag": "P",
  "text": "Neuroscience says the only way to deal with fear: you need to face it, head-on. When we avoid scary things we become more scared. When you face your fears they become less frightening.",
  "translation": "神经科学说，应对恐惧的唯一方法是：您必须直面恐惧。 当我们避免可怕的事情时，我们会变得更加害怕。 当您面对恐惧时，恐惧感就会减轻。"
}, {
  "tag": "P",
  "text": "And to face fear, you need to have a growth mindset. When you are dealing with a difficult situation, too often your confidence takes a knock and you tend to underestimate your capability to deliver. To counteract this, cultivate a growth mindset.",
  "translation": "面对恐惧，您需要有成长的心态。 当您面对困难处境时，您的自信常常会受到打击，并且您往往会低估自己的交付能力。 为了解决这个问题，培养成长心态。"
}, {
  "tag": "P",
  "text": "Honor the strength of your past. Remember the struggles and the effort put in by you that made you such a great developer. Create a long list of all of your strengths and achievements. If we respect ourselves and honor our strengths, we automatically become stronger and wiser in times of struggle.",
  "translation": "尊重您过去的力量。 记住使您成为如此出色的开发人员的努力和努力。 创建一长串所有您的长处和成就。 如果我们尊重自己并尊重自己的优势，那么我们在斗争中会自动变得更加强大和明智。"
}, {
  "tag": "P",
  "text": "And rather than focusing on the difficulties you are facing, focus on what the experience can teach you. Make a conscious effort to absorb the learnings rather than getting bogged down by frustration.",
  "translation": "与其专注于所面临的困难，不如专注于经验可以教给您的东西。 做出有意识的努力以吸收学习，而不是因挫败而陷入困境。"
}, {
  "tag": "P",
  "text": "And remember to have a moral compass in place. Good developers have a strong sense of right and wrong. If things are wrong, ‘stick your neck out’ and do the right thing despite told otherwise.",
  "translation": "并记住要有道德上的指南针。 优秀的开发人员具有强烈的是非意识。 如果情况有误，请“伸出脖子”，然后做正确的事，尽管另有说明。"
}, {
  "tag": "H1",
  "text": "Prioritize ruthlessly.",
  "translation": "狠下轻重缓急。"
}, {
  "tag": "P",
  "text": "Good developers know the art of prioritization very well. They don’t get overwhelmed by urgency.",
  "translation": "好的开发人员非常了解优先排序的技巧。 他们不会被紧急情况淹没。"
}, {
  "tag": "P",
  "text": "For example, you are working on getting the production code ready for the loan origination system and the most important thing for you should be to get the work done for the client when they are expecting it. During your programming time, you will get several other activities like meetings, discussion of other areas, presales discussions with prospective clients, etc. You need to make sure that each of these ‘other’ tasks does not interfere with your ability to meet the deadlines of the project.",
  "translation": "例如，您正在为贷款发起系统准备生产代码，而最重要的事情应该是在客户期望时为客户完成工作。 在编程期间，您还将参加其他活动，例如会议，其他领域的讨论，与潜在客户的售前讨论等。您需要确保这些“其他”任务均不会干扰您按时完成任务的能力 该项目。"
}, {
  "tag": "P",
  "text": "An easy approach to prioritize work will be the follow the urgency-important matrix.",
  "translation": "遵循紧迫性重要矩阵是确定工作优先级的简单方法。"
}, {
  "tag": "P",
  "text": "· Urgent and Important — Topmost priority",
  "translation": "·紧急和重要-最优先"
}, {
  "tag": "P",
  "text": "· Urgent and not important — Calls, meetings and any activity which is not helping you to meet your deadline. Postpone them.",
  "translation": "·紧急但不重要-通话，会议和任何无法帮助您按时完成的活动。 推迟他们。"
}, {
  "tag": "P",
  "text": "· Important but not urgent — Can wait or can be delegated.",
  "translation": "·重要但不紧急-可以等待或可以委派。"
}, {
  "tag": "P",
  "text": "· Not important and not urgent — Don’t waste your time on this.",
  "translation": "·不重要也不紧急-不要在此上浪费时间。"
}, {
  "tag": "P",
  "text": "And if interruptions go beyond your control, consider using an ‘out-of-office’ message stating that you are in an important work and will only be available after so-and-so date. Sometimes there is no harm to be unavailable.",
  "translation": "而且，如果打扰超出了您的控制范围，请考虑使用“外出”消息，说明您正在进行重要工作，并且只能在某某日期之后才能使用。 有时候，没有危害是不可能的。"
}, {
  "tag": "H1",
  "text": "Challenge the deadlines.",
  "translation": "挑战截止日期。"
}, {
  "tag": "P",
  "text": "By challenging the deadlines, I do not mean refusing it outright or fighting with your superior or client. Challenging means to take a proactive solution-based tone while reacting to unreasonable deadlines.",
  "translation": "通过挑战截止日期，我并不是要完全拒绝截止日期或与您的上级或客户打架。 具有挑战性的方法是在应对不合理的截止日期时采取基于解决方案的主动态度。"
}, {
  "tag": "P",
  "text": "Some of the ways can be.",
  "translation": "某些方法可以。"
}, {
  "tag": "P",
  "text": "· Work backward from the deadline and map out realistically as to how much work can be done by you or others and by when.",
  "translation": "·从截止日期开始倒退，并就您或他人可以完成多少工作以及何时完成进行现实的规划。"
}, {
  "tag": "P",
  "text": "· Highlight the dependencies carefully well in advance. For example, “I can finish the code for the loans module but the ATM switch code needs to be in place before that.”",
  "translation": "·事先仔细突出显示依赖性。 例如，“我可以完成贷款模块的代码，但是在此之前必须有ATM交换代码。”"
}, {
  "tag": "P",
  "text": "· Break the deadline up into a series of small milestones and set yourself a deadline for each. This will keep you motivated and on track towards the final deadline.",
  "translation": "·将截止日期分成一系列小的里程碑，并为每个里程碑设定截止日期。 这将使您充满动力，并朝着最后期限的方向前进。"
}, {
  "tag": "P",
  "text": "· The key to questioning deadlines is educating yourself about the real purpose. Is there any pressing need for this urgency? Are they aware of the quality impact of the deadline? Are they lacking any information which they should know? Question the intent until you can get the real reason and suggest a solution towards it.",
  "translation": "·质疑截止日期的关键是使自己了解真正的目的。 是否有迫切需要解决这一紧急情况？ 他们是否了解截止日期的质量影响？ 他们缺乏应知道的信息吗？ 质疑意图，直到您能找到真正的原因并提出解决方案。"
}, {
  "tag": "P",
  "text": "· Lastly say ‘NO’ if the deadline is really unreasonable. Your superiors will respect you more if you insist on quality rather than compromising on a rush job.",
  "translation": "·最后，如果最后期限确实不合理，请说“不”。 如果您坚持质量而不是妥协，那么您的上司会更尊重您。"
}, {
  "tag": "P",
  "text": "Remember at the end of the day you are a professional and a professional does the right thing always even in situations when he is under pressure to do the wrong. Be a professional.",
  "translation": "记住，到头来，您是一个专业人士，即使在他面临做错事情的压力下，他也总是做正确的事。 成为专业人士。"
}, {
  "tag": "H1",
  "text": "Good Developers Are Practical Not Emotional.",
  "translation": "优秀的开发人员务实而不是动情。"
}, {
  "tag": "H2",
  "text": "Strategies to help you manage the difficult situations that developers face at work",
  "translation": "帮助您管理开发人员在工作中面临的困境的策略"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/0*S84feCFBrK6D0njd?q=20",
  "caption": "Photo by AJ Garcia on Unsplash",
  "type": "image",
  "file": "0!S84feCFBrK6D0njd"
}, {
  "tag": "P",
  "text": "Perhaps the best inspiration for a practical developer was shared by Sundar Pichai, Google CEO in his famous cockroach theory. A cockroach? Yes, you heard that right!",
  "translation": "Google首席执行官Sundar Pichai以其著名的蟑螂理论分享了实用开发人员的最佳灵感。 蟑螂？ 是的，你听到的是对的！"
}, {
  "tag": "P",
  "text": "As the story goes, once at a restaurant, a cockroach flew in and sat on a lady. As a natural reaction, the lady screamed in fear. The insect suddenly flew onto some other lady in the restaurant. She too screamed in fear. In fact, having panicked, she started to jump, flailing bother arms desperately trying to get rid of the cockroach. Such reactions are always contagious and therefore, all her group members had now panicked. The cockroach now jumped onto another lady in the group and some more drama ensued. A waiter rushed to help her and finally, the cockroach landed on him.",
  "translation": "传说中，一次在餐馆里，一只蟑螂飞进来，坐在一位女士身上。 这位女士自然而然地尖叫着。 昆虫突然飞到了餐厅的另一位女士身上。 她也因恐惧而尖叫。 实际上，在惊慌失措的情况下，她开始跳跃，拼命挥动手臂，试图摆脱蟑螂。 这种反应总是具有传染性，因此，她的所有小组成员现在都感到恐慌。 蟑螂现在跳上了小组中的另一位女士，随后发生了更多戏剧性事件。 一个服务员冲上去帮助她，最后，蟑螂落在了他身上。"
}, {
  "tag": "P",
  "text": "And Instead of screaming, the waiter stood firmly, watched the cockroach and confidently, he grabbed it off his shirt and threw it out.",
  "translation": "服务员没有大声尖叫，而是站稳了脚步，看着蟑螂，自信地把它从衬衫上抓下来，扔了出去。"
}, {
  "tag": "P",
  "text": "As Sundar Pichai contemplates afterwards.",
  "translation": "正如Sundar Pichai之后所考虑的那样。"
}, {
  "tag": "P",
  "text": "“Sipping coffee and being witness to the drama, I wondered if the cockroach alone was responsible for all the hysterical behavior? No. In reality, the cockroach did nothing just land on people and it were the restaurant’s patrons who were unable to handle the disturbance caused by the mere insect. In reality, too, it is not the yelling of our superiors, family members, fights with our spouses or the traffic jam that causes us to behave out of character. It is our inability to handle such situations and the inability to handle the disturbances caused by such situations that disturb us.”",
  "translation": "“我边喝咖啡边看电视剧，我想知道蟑螂是否是造成所有歇斯底里行为的原因？ 不。实际上，蟑螂什么也没落在人身上，而是餐厅的顾客无法应付仅由昆虫引起的干扰。 实际上，也是导致上司表现不佳的原因不是上司，家人的大喊大叫，与配偶打架或交通堵塞。 我们无法处理这种情况，也无法处理由这种情况引起的干扰我们的干扰。”"
}, {
  "tag": "P",
  "text": "In short, it is not the problem itself but our reaction to it that causes misery in our lives.",
  "translation": "简而言之，不是问题本身，而是我们对问题的反应导致我们生活的痛苦。"
}, {
  "tag": "P",
  "text": "That said, a developer’s life can be challenging at times. Unrealistic deadlines, overcommitting superiors, the loving code crafted by you which does not work in production or worse still, your loving code screwed up mercilessly by a novice developer. The situations that can cause distress are endless.",
  "translation": "也就是说，开发人员的生活有时可能会充满挑战。 不切实际的截止日期，过多的上司，您精心制作的，无法在生产中使用的代码或什至更糟的是，新手开发人员无情地破坏了您的代码。 可能造成困扰的情况是无止境的。"
}, {
  "tag": "P",
  "text": "Breaking down and letting your anger get the best of you often turn out to be stupid and immature in most of the cases. Granted, life doesn’t always throw us pleasantries, but also disappointments which we definitely have to learn to deal with. On the other hand, avoiding the problems or blaming it on others is also not a viable solution.",
  "translation": "在大多数情况下，分解并让您的怒气变得最好，往往变得愚蠢和不成熟。 诚然，生活并不总是会给我们带来欢乐，而是我们一定要学会应付的失望。 另一方面，避免问题或将其归咎于其他问题也不是可行的解决方案。"
}, {
  "tag": "P",
  "text": "A developer needs to practically respond (stop and think about what he needs to face) to situations instead of reacting to them. Doing this, we will develop the right attitude to enrich his life, despite the challenges thrown at him.",
  "translation": "开发人员实际上需要对情况做出响应（停止思考自己需要面对的事情），而不是对情况做出反应。 这样做，尽管面临挑战，我们仍将树立正确的态度以丰富他的生活。"
}, {
  "tag": "P",
  "text": "The key is to experience uncomfortable emotions but not get stuck in them. Emotions have the ability to cloud our judgment. And just like any other skill, managing your emotions and being practical in times of stress is a hallmark of a good developer.",
  "translation": "关键是要体验不舒服的情绪，但不要陷入其中。 情绪有能力遮盖我们的判断力。 与其他任何技能一样，管理自己的情绪并在压力大的情况下保持实践性是一个优秀开发人员的特点。"
}, {
  "tag": "P",
  "text": "And here are some ways in which it can be done.",
  "translation": "这是完成它的一些方法。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Ravi Shankar Rajan的文章《Good Developers Are Practical Not Emotional.》，参考：https://levelup.gitconnected.com/good-developers-are-practical-not-emotional-a57d04376bd2)",
  "translation": "（本文翻译自Ravi Shankar Rajan的文章，“优秀的开发人员是实践而不是情感上的。”，参考：https：//levelup.gitconnected.com/good-developers-are-practical-not-emotional-a57d04376bd2）"
}]