[{
  "tag": "H1",
  "text": "Collect Data From Primary Source",
  "translation": "从主要来源收集数据"
}, {
  "tag": "P",
  "text": "I use a web scraping tool to save the efforts from building a scraper in order to pull data from each website. There are many options but I found Octoparse to be the best. They recently created a scraping “recipe” to extract live data from that China Healthcare Department’s database. This is so much easier as I don’t even need to configure the task as most scraping tools require, making the data more accessible to everyone.",
  "translation": "我使用Web抓取工具来节省构建抓取器的工作，以便从每个网站提取数据。 有很多选择，但是我发现Octoparse是最好的。 他们最近创建了一个抓取“食谱”，以从该中国卫生部的数据库中提取实时数据。 这非常容易，因为我什至不需要配置大多数抓取工具所需的任务，从而使每个人都可以访问数据。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*1j3lKJ4kR_L_mbeC1hB1mg.jpeg?q=20",
  "caption": "scraping results in Excel",
  "type": "image",
  "file": "1!1j3lKJ4kR_L_mbeC1hB1mg.jpeg"
}, {
  "tag": "H2",
  "text": "Data Analysis",
  "translation": "数据分析"
}, {
  "tag": "P",
  "text": "I collected data ranging from January 22nd to February 4th. The data indicates the number of infected cases increases without any sign of slowing down. Yet, the number of suspected infections declines steadily, which indicates the overall suspected infection pool has been shrinking as they have turned into confirmed cases.",
  "translation": "我收集了1月22日至2月4日的数据。 数据表明，受感染的病例数在增加，而没有任何放缓的迹象。 但是，可疑感染的数量在稳步下降，这表明随着已被确诊的病例，总体可疑感染池正在缩小。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*qQDye-2BdNeIPa017jXsKw.jpeg?q=20",
  "caption": "suspected infecctions",
  "type": "image",
  "file": "1!qQDye-2BdNeIPa017jXsKw.jpeg"
}, {
  "tag": "P",
  "text": "However, some people discovered that the death counts are a little bit on the odd side. I pulled the numbers and did a little research. According to the data, the death rate in Hubei province by far is 2.7%, compared to 0.19% elsewhere in China. That means Hubei has 15 times more death rates than the rest of the country."
}, {
  "tag": "P",
  "text": "In this case, we draw two assumptions that may lead to such high discrepancy:",
  "translation": "在这种情况下，我们得出两个可能导致如此高的差异的假设："
}, {
  "tag": "P",
  "text": "Assumption 1: The government has under-reported the actual infected cases.",
  "translation": "假设1：政府未充分报告实际感染病例。"
}, {
  "tag": "P",
  "text": "Disproof: If the statement is true, the actual number of infected would be the death toll divided by 0.19%, which equals to 288,947. The result is contradicted with the R0 (reproduction number of an infection) which is the metric used to measure how contagious a virus is likely to be. Most studies [Maclntyre, 2020] show that the R0 in this outbreak is between 2 to 2.5 which is a little higher than a seasonal flu. As a result, it isn’t likely the coronavirus becomes so contagious that it would infect around 300,000 in less than a month."
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*4z9kPhR6KY4NmKQlWArP3Q.jpeg?q=20",
  "caption": "from New York Times",
  "type": "image",
  "file": "1!4z9kPhR6KY4NmKQlWArP3Q.jpeg"
}, {
  "tag": "P",
  "text": "So what other factors would cause such a high fatality rate?",
  "translation": "那么还有哪些其他因素会导致如此高的死亡率呢？"
}, {
  "tag": "P",
  "text": "Assumption 2: People can’t be cured because of shortage in health resources.",
  "translation": "假设2：由于医疗资源短缺，人们无法治愈。"
}, {
  "tag": "P",
  "text": "This statement makes more sense. The shortage of medical supplies, hospital beds and staffing would lead to more people left with no choice besides self-quarantine at home. Improper self-medication exacerbates the illness. In addition, coronavirus is fatal to the seniors with pre-existing health issues, let alone lack of proper treatment in time.",
  "translation": "这种说法更有意义。 医疗用品，病床和人员的短缺将导致更多的人除了在家中自我隔离外别无选择。 自我用药不当会加重病情。 此外，冠状病毒对存在健康问题的老年人是致命的，更不用说及时缺乏适当的治疗了。"
}, {
  "tag": "P",
  "text": "That being said, the coronavirus isn’t lethargic as it appears to the general public in the U.S. As there are more healthcare resources available in the United States than most countries in the rest of the world, we really should not get terrified of the disease that is a Pacific Ocean away. Furthermore, the U.S. government has already banned foreign nationals who have traveled in China for the past 14 days from coming in (except immediate relatives of citizens and permanent residents). On the other hand, the undergoing seasonal flu that caused 19 millions illnesses and 10,000 deaths is more worrisome than the new coronavirus.",
  "translation": "话虽这么说，但冠状病毒并不像在美国普通公众面前那样令人昏昏欲睡。由于美国拥有的医疗资源比世界上其他大多数国家都多，因此我们真的不应该对这种疾病感到恐惧 那是太平洋。 此外，美国政府已经禁止过去14天来中国旅行的外国人入境（公民和永久居民的直系亲属除外）。 另一方面，与新的冠状病毒相比，季节性流感导致的1900万例疾病和10,000例死亡更令人担忧。"
}, {
  "tag": "H1",
  "text": "News Reports Collection:",
  "translation": "新闻报道集："
}, {
  "tag": "P",
  "text": "Using the scraping tool, I also collected news reports since the outbreak from dozens of media channels. Just in case you haven’t used a scraping tool, this video may help create advanced scraping tasks.",
  "translation": "自爆发以来，我还使用抓取工具从数十个媒体渠道收集了新闻报道。 万一您没有使用过抓取工具，该视频可能有助于创建高级抓取任务。"
}, {
  "tag": "P",
  "text": "I scraped articles from the Wall Street Journal, New York Times, and Reuters through the search term “coronavirus” in order to compare the difference among a few news media.",
  "translation": "我通过搜索词“冠状病毒”从《华尔街日报》，《纽约时报》和《路透社》上抓了一些文章，以比较几种新闻媒体之间的差异。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*fgglTpZaI1-F4yvPf9LHRw.jpeg?q=20",
  "caption": "scraping Wall Street Journal",
  "type": "image",
  "file": "1!fgglTpZaI1-F4yvPf9LHRw.jpeg"
}, {
  "tag": "P",
  "text": "Many news articles put a lot of emphasis on the severity of the outbreak and lighten up other metrics like suspected infections and recovery numbers. Such incomplete narratives lead to a false impression about not only the Chinese government but also the disease itself. As a result, we become paranoid when we see others cough, catch a cold, or even shake hands with colleagues of different races.",
  "translation": "许多新闻文章都将重点放在爆发的严重程度上，并减轻了诸如可疑感染和恢复数量之类的其他指标。 这种不完整的叙述不仅对中国政府而且对疾病本身都产生了错误的印象。 结果，当我们看到其他人咳嗽，感冒甚至与不同种族的同事握手时，我们就会变得偏执。"
}, {
  "tag": "P",
  "text": "I came across this news article from WSJ written by Walter Mead entitled “China Is the Real Sick Man of Asia.” Regardless of the title being extremely xenophobic, there are dozens of places in his article showed disinformation. He said that “We do not know how dangerous the new coronavirus will be. There are signs that Chinese authorities are still trying to conceal the true scale of the problem.” On the article’s publication date, the WTO has already discovered that the R0 was around 2, and the fatality rate was less than 3 percent which is close to a seasonal flu. In addition, there is no evidence to prove that Chinese government tried to hide anything. In fact, the data I got from the open source database in China government website was consistent with the data from WHO, CDC, ECDE, NHC and DXY. There are factors that could affect the accuracy, however, the miscalculation should be within permissible range not to get questioned by worldwide mainstream media.",
  "translation": "我从《华尔街日报》上看到了沃尔特·米德（Walter Mead）撰写的题为“中国是亚洲的真正病夫”的新闻。尽管标题极度仇外，但他的文章中有很多地方显示了虚假信息。 他说：“我们不知道新的冠状病毒将有多危险。 有迹象表明，中国当局仍在努力掩盖问题的真实范围。”在本文发表之日，WTO已经发现R0约为2，病死率不到3％，接近 季节性流感。 此外，没有证据表明中国政府试图隐藏任何东西。 实际上，我从中国政府网站的开源数据库中获得的数据与WHO，CDC，ECDE，NHC和DXY的数据一致。 有一些因素可能会影响准确性，但是，错误计算应在允许的范围内，以免受到全球主流媒体的质疑。"
}, {
  "tag": "P",
  "text": "Mead also posted a video entitled “A Communist Coronavirus” which declared the actual cheering sound (Wuhan, Jia You!) from the public in the video as anSOS signal of “a total lockdown in Wuhan, Hubei, China.” “Communist” is a political party term. Mead used it as an adjective to describe an illness which underlies a sense of possessiveness. Moreover, the Chinese people were shouting “Hanging in there, Wuhan!” in the video. Yet, the narratives made it seem people were desperately yelling for help because of the lockdown.",
  "translation": "米德还发布了一个名为“共产冠状病毒”的视频，该视频在视频中从公众宣告了真正的欢呼声（武汉，加油！），这是“整个湖北武汉处于封锁状态”的一个SOS信号。 “共产党”是一个政党用语。 米德用它作为形容词来描述一种占有欲的疾病。 而且，中国人民大喊“武汉，在那里！” 在视频中。 然而，这些叙述使人们似乎似乎因为封锁而急切地寻求帮助。"
}, {
  "tag": "P",
  "text": "This reminds me of a tweet posted on January 31st, when an Asian woman said a patient was joking about shaking her hand because of coronavirus. This was not the only joke spread on Twitter. As thousands of people are undergoing a sensation of fear, the outbreak of coronavirus becomes an entertaining content used to discriminate against certain groups of people.",
  "translation": "这让我想起1月31日发布的一条推文，当时一名亚裔女子说一名患者因冠状病毒而在开玩笑而开玩笑。 这不是在Twitter上传播的唯一笑话。 当成千上万的人开始感到恐惧时，冠状病毒的爆发成为一种娱乐性的内容，用于歧视某些人群。"
}, {
  "tag": "P",
  "text": "Just like the outbreak of the HIV panic in the 1980s that led to the criminalization of the LGBTQ people, infectious disease has been used by the general public to justify prejudice. Doesn’t it make people feel furious?",
  "translation": "就像1980年代爆发的HIV恐慌导致LGBTQ人群被定罪一样，传染病已被广大公众用来证明偏见。 不会让人生气吗？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*cyE4WsHScEp7nX3s7JQMXA.jpeg?q=20",
  "caption": "https://reason.com/2019/10/11/democratic-candidates-promise-lgbt-voters-theyll-punish-all-the-right-people/",
  "type": "image",
  "file": "1!cyE4WsHScEp7nX3s7JQMXA.jpeg"
}, {
  "tag": "P",
  "text": "I would like to quote from Frank Shyong, a columnist from the Los Angeles Times, “Our willingness to understand each other is what protects us from fear and its disastrous consequences.” Let’s not exaggerate the threat of the disease, nor fuel the racism attitude that already has been too much in this country. It’s our rightousness to learn about facts and not spread any xenophobic comments.",
  "translation": "我想引用《洛杉矶时报》专栏作家弗兰克·谢勇（Frank Shyong）的话说：“我们彼此了解的意愿是保护我们免受恐惧及其灾难性后果的原因。” 这个国家已经太多了。 了解事实而不散布仇外言论是我们的正义。"
}, {
  "tag": "H2",
  "text": "source:",
  "translation": "资源："
}, {
  "tag": "P",
  "text": "http://theconversation.com/how-contagious-is-the-wuhan-coronavirus-and-can-you-spread-it-before-symptoms-start-130686",
  "translation": "http://theconversation.com/how-contagious-is-the-wuhan-coronavirus-and-can-you-spread-it-before-symptoms-start-130686"
}, {
  "tag": "P",
  "text": "https://www.latimes.com/california/story/2020-02-03/coronavirus-outbreak-narrative-xenophobia",
  "translation": "https://www.latimes.com/california/story/2020-02-03/coronavirus-outbreak-narrative-xenophobia"
}, {
  "tag": "P",
  "text": "https://www.nytimes.com/interactive/2020/world/asia/china-coronavirus-contain.html",
  "translation": "https://www.nytimes.com/interactive/2020/world/asia/china-coronavirus-contain.html"
}, {
  "tag": "P",
  "text": "https://en.wikipedia.org/wiki/Basic_reproduction_number",
  "translation": "https://en.wikipedia.org/wiki/Basic_reproduction_number"
}, {
  "tag": "H1",
  "text": "How Data Analysis Helps Unveil the Truth of Coronavirus",
  "translation": "数据分析如何帮助揭示冠状病毒的真相"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*9six189IOHYgwWbbtXhe3w.png?q=20",
  "caption": "https://www.chappatte.com/en/",
  "type": "image",
  "file": "1!9six189IOHYgwWbbtXhe3w.png"
}, {
  "tag": "P",
  "text": "These days we are all scared of the new airborne contagious coronavirus (2019-nCoV). Even if it is a tiny cough or low fever, it might underlie a lethargic symptom. However, what is the real truth?",
  "translation": "这些天，我们都害怕新的空中传播性冠状病毒（2019-nCoV）。 即使是轻微的咳嗽或低烧，也可能是昏睡症状的基础。 但是，真正的真相是什么？"
}, {
  "tag": "P",
  "text": "On February 3rd, someone posted a tweet falsely claiming a coronavirus case was confirmed around the Lorenzo housing in USC, a populous place with Chinese international students. Then, another tweet came along claiming his friend’s roommate brother girlfriend also got infected. People retweeted and panicked. Later, the University clarified this was a mix-up, that no coronavirus cases had been suspected or confirmed.",
  "translation": "2月3日，有人发布了一条推文，声称在USC的洛伦佐（Lorenzo）住所周围证实了冠状病毒病例，该校是中国留学生人口众多的地方。 然后，另一条推文出现了，声称他朋友的室友兄弟女友也被感染了。 人们转推并感到恐慌。 后来，大学澄清这是一种混淆，没有怀疑或证实过冠状病毒病例。"
}, {
  "tag": "P",
  "text": "This is how rumors get spread rapidly and eventually become “fact” — — when people are ignorant regarding the truth. I thought it’d be necessary to collect data from both official and unofficial sources, and stay impartial. More importantly, the public needs to have a fair-minded understanding of this outbreak with transparent data sources.",
  "translation": "当人们对真理一无所知时，这就是谣言迅速传播并最终成为“事实”的方式。 我认为有必要从官方和非官方来源收集数据，并保持公正。 更重要的是，公众需要使用透明的数据源对这次疫情有一个公正的认识。"
}, {
  "tag": "H2",
  "text": "The goal of this article is to collect data from primary sources, and make the data reliable and transparent. As we collect more accurate information, it would help the public discover the facts and restrain extreme opinions.",
  "translation": "本文的目的是从主要来源收集数据，并使数据可靠透明。 当我们收集更准确的信息时，它将帮助公众发现事实并束缚极端观点。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Ashley Ng的文章《How Data Analysis Helps Unveil the Truth of Coronavirus》，参考：https://towardsdatascience.com/how-data-analysis-helps-unveil-the-truth-of-coronavirus-8430de107ba4)",
  "translation": "（本文翻译自Ashley Ng的文章，《数据分析如何帮助揭示冠状病毒的真相》，参考：https：//towardsdatascience.com/how-data-analysis-helps-unveil-the-truth-of-coronavirus-8430de107ba4）"
}]