[{
  "tag": "P",
  "text": "Okay okay, back to math.",
  "translation": "好吧好吧，回到数学上。"
}, {
  "tag": "P",
  "text": "Why study abstract mathematics? Because abstraction equals portability. I can be an engineer working on some problem in, say, fluid mechanics. It might be tough, but after a while, I get a solution. An electrical engineer might be working on the same mathematical problem. But with one difference: he has an electrical interpretation rather than a fluid mechanical one.",
  "translation": "为什么要学习抽象数学？ 因为抽象等于可移植性。 我可以成为一名工程师，研究流体力学中的某些问题。 可能很难，但是过了一会儿，我得到了解决方案。 电气工程师可能正在研究相同的数学问题。 但是有一个区别：他有一种电子解释而不是一种流体力学的解释。"
}, {
  "tag": "P",
  "text": "In the Feynman Lectures on Physics, this point is illustrated beautifully in the section “The Same Equations Have the Same Solution”. He gives a brief tour of how Maxwell’s equations of electromagnetism govern all kinds of other phenomena:",
  "translation": "在费曼物理学讲座中，“相同的方程式具有相同的解决方案”部分对此进行了很好的说明。 他简要介绍了麦克斯韦的电磁方程如何控制所有其他现象："
}, {
  "tag": "UL",
  "texts": ["Heat flow", "The motion of a stretched membrane", "Diffusion of neutrons through a medium", "Fluid flow", "Uniform lighting of a plane"],
  "translations": ["热流", "拉伸膜的运动", "中子通过介质的扩散", "流体流量", "飞机的均匀照明"]
}, {
  "tag": "P",
  "text": "The thing linking all these physical phenomena is abstract mathematics.",
  "translation": "连接所有这些物理现象的事物是抽象数学。"
}, {
  "tag": "P",
  "text": "So, why is it useful to study abstract mathematics? Because you may solve six physics problems at once!",
  "translation": "那么，为什么研究抽象数学有用呢？ 因为您可以一次解决六个物理问题！"
}, {
  "tag": "H1",
  "text": "Wait a second. What if we would not know all that math?",
  "translation": "等一等。 如果我们不知道所有这些数学怎么办？"
}, {
  "tag": "P",
  "text": "I will express a somewhat paradoxical opinion:",
  "translation": "我会表达一些自相矛盾的观点："
}, {
  "tag": "P",
  "text": "Right up to the era of steam, Mathematics, although it was very desirable and helpful, was not required. It is possible, theoretically, to imagine a civilization that builts steam locomotives, but only knows how to divide and multiply.",
  "translation": "直到蒸汽时代，数学虽然是非常理想和有用的，但它并不是必需的。 从理论上讲，可以想象一个建造蒸汽机车但只知道如何分裂和繁殖的文明。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*ryTvtTK39NfBqhYq?q=20",
  "caption": "Photo by K B on Unsplash",
  "type": "image",
  "file": "0!ryTvtTK39NfBqhYq"
}, {
  "tag": "P",
  "text": "No, but really. You will say heat engines, thermodynamics. But what if you do not go into the depths? Gases expand linearly with temperature and to understand that the piston will push the steam, the set theory is useless. It is possible to grind all this and assemble by trials and errors.",
  "translation": "不，但是真的。 您会说热机，热力学。 但是，如果您不深入，该怎么办？ 气体随温度线性增长，并且要了解活塞会推动蒸汽，因此定论毫无用处。 可以研磨所有这些并通过反复试验来组装。"
}, {
  "tag": "P",
  "text": "Of course, you can’t do a microcircuit on a hunch — here you need to understand quantum mechanics. But knowledge of the non-trivial zeros of the Riemann zeta function does not have any effect on the construction of the engine!",
  "translation": "当然，您不能凭直觉来做微电路-在这里您需要了解量子力学。 但是，了解黎曼zeta函数的非平凡零点对引擎的构造没有任何影响！"
}, {
  "tag": "H1",
  "text": "But something is missing in the story",
  "translation": "但是故事中缺少一些东西"
}, {
  "tag": "P",
  "text": "Nothing of that, either it’s a wheel or a steam locomotive would not be possible without an abstraction. We would not be able to build anything of that without an imaginary game and ability to create abstraction. Because they are much easier for understanding and sharing instead of a complex reality.",
  "translation": "没有任何东西，没有抽象就不可能是车轮或蒸汽机车。 没有虚构的游戏和创建抽象的能力，我们将无法构建任何东西。 因为它们比复杂的现实更容易理解和共享。"
}, {
  "tag": "P",
  "text": "And that’s what math teaches us!",
  "translation": "这就是数学教给我们的！"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*SijHllDwD4nGs4Uh?q=20",
  "caption": "Photo by Iñaki del Olmo on Unsplash",
  "type": "image",
  "file": "0!SijHllDwD4nGs4Uh"
}, {
  "tag": "H1",
  "text": "Do we Need Math? Imagine our Life Without It",
  "translation": "我们需要数学吗？ 想象没有它的生活"
}, {
  "tag": "H2",
  "text": "Journey to the world without math and why abstractions are the key to everything",
  "translation": "没有数学的世界之旅，以及为什么抽象是一切的关键"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*A_DsJJr1lF7dDmWe?q=20",
  "caption": "Photo by Deepak Gautam on Pexels",
  "type": "image",
  "file": "0!A_DsJJr1lF7dDmWe"
}, {
  "tag": "P",
  "text": "Do you remember your math classes in school? I definitely do, and on my mind was always:",
  "translation": "你还记得你在学校的数学课吗？ 我绝对会这样做，在我心中一直是："
}, {
  "tag": "P",
  "text": "“Why do I need this formula? Where will I use that theorem?”",
  "translation": "“为什么我需要这个公式？ 我将在哪里使用该定理？”"
}, {
  "tag": "P",
  "text": "You heard or even asked the same questions. After that, the teacher used to explain that we can use integral to find the area and derivative to get the acceleration from speed.",
  "translation": "您听到甚至问了同样的问题。 之后，老师曾经解释说，我们可以使用积分来找到面积和导数，以从速度中获得加速度。"
}, {
  "tag": "P",
  "text": "“And what?” — the question always appeared but was newer asked. Most people will never be trying to find a minimum/maximum of the function in daily life.",
  "translation": "“又是什么？” —这个问题总是出现，但是是新的问题。 大多数人永远不会试图在日常生活中找到功能的最小/最大。"
}, {
  "tag": "P",
  "text": "However, all of us need math, and it’s essential in your career, decision making and any field of life.",
  "translation": "但是，我们所有人都需要数学，这对您的职业生涯，决策制定和任何生活领域都至关重要。"
}, {
  "tag": "H1",
  "text": "The reason is abstractions",
  "translation": "原因是抽象"
}, {
  "tag": "P",
  "text": "Do you remember that day when the teacher started writing letters instead of numbers? Was this easy for you?",
  "translation": "您还记得老师开始写字母而不是数字的那一天吗？ 这样方便吗？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*WuerV_Bj_ZPr-U8Y?q=20",
  "caption": "Photo by Roman Mager on Unsplash",
  "type": "image",
  "file": "0!WuerV_Bj_ZPr-U8Y"
}, {
  "tag": "P",
  "text": "I was always pretty good at math, but it took me a lot of effort to stop fearing letters in formulas.",
  "translation": "我一直都很擅长数学，但是我花了很多精力才停止担心公式中的字母。"
}, {
  "tag": "P",
  "text": "Why do I write fancy letters in formulas instead of numbers?",
  "translation": "为什么我在公式中写花式字母而不是数字？"
}, {
  "tag": "P",
  "text": "A familiar feeling? But the idea is that everything in math is an abstraction.",
  "translation": "熟悉的感觉？ 但想法是，数学中的所有内容都是抽象的。"
}, {
  "tag": "P",
  "text": "You understand what is apple, but what is the number? Right, it’s the abstraction to help us to count apples. The same with any other idea in math, either it’s multiplication or Newton–Raphson root-finding algorithm",
  "translation": "您了解什么是苹果，但是多少？ 是的，它是帮助我们计算苹果的抽象概念。 数学上的任何其他想法都一样，无论是乘法还是牛顿-拉夫森求根算法"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*eCb5uh0WRA8GWZuN?q=20",
  "caption": "Photo by Ben White on Unsplash",
  "type": "image",
  "file": "0!eCb5uh0WRA8GWZuN"
}, {
  "tag": "P",
  "text": "Math is abstract because numbers are not real entities. They are purely imaginary concepts. We cannot experience numbers. We can make up stories about them, such as “1+1=2”. But, we can never experience such operation since there is no such thing as ONE of anything in our experience. If there is no such thing as ONE of anything in our experience, there can be no such thing as TWO of anything in our experience, etc.",
  "translation": "数学是抽象的，因为数字不是真实的实体。 它们纯粹是虚构的概念。 我们无法体验数字。 我们可以编造有关它们的故事，例如“ 1 + 1 = 2”。 但是，我们永远都不会经历这样的操作，因为我们的经历中没有任何一件事情。 如果我们的经验中没有任何事物之一，那么我们的经验中就不会存在任何事物之二等等。"
}, {
  "tag": "P",
  "text": "When we do math, we are playing a game in a world of imagination. Like fairy tales, numbers are the characters in that imaginary world, while the operations are the activities that those fairy tale characters perform.",
  "translation": "当我们做数学时，我们在充满想象力的世界中玩游戏。 像童话一样，数字是那个虚构世界中的人物，而操作则是那些童话人物所进行的活动。"
}, {
  "tag": "P",
  "text": "And just like fairy tales, math can be beneficial, even though neither numbers nor fairy tale characters really exist.",
  "translation": "就像童话一样，即使数字和童话人物都不存在，数学也可能是有益的。"
}, {
  "tag": "P",
  "text": "Berj Manoushagian, Philosopher.",
  "translation": "哲学家Berj Manoushagian。"
}, {
  "tag": "H1",
  "text": "Why are abstractions crucial?",
  "translation": "为什么抽象至关重要？"
}, {
  "tag": "P",
  "text": "Because it’s an amazingly powerful tool. Even more powerful than mathematics itself.",
  "translation": "因为它是一个非常强大的工具。 比数学本身更强大。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*9m3nPlqSqy6yzVtm?q=20",
  "caption": "Photo by Hunter Harritt on Unsplash",
  "type": "image",
  "file": "0!9m3nPlqSqy6yzVtm"
}, {
  "tag": "P",
  "text": "Let me back up a little bit. Forget mathematics. When was the last time you made pasta? You know how to make pasta, right? Boil water, add pasta, wait a little bit, then take out the pasta. If you’re feeling fancy, add some other stuff.",
  "translation": "让我备份一点。 忘记数学。 您最后一次做面食是什么时候？ 你知道怎么做意大利面吧？ 将水煮沸，加入意大利面，稍等片刻，然后取出意大利面。 如果您喜欢，请添加其他内容。"
}, {
  "tag": "P",
  "text": "Already, you’re taking advantage of abstractions. How do you know how long to boil that pasta? Isn’t it conceivable that one noodle of pasta differs in some way from another noodle of pasta, even in the same box? But you avoid those questions by abstraction. You don’t worry about the specific noodles of pasta you have, but you treat it like this abstract collection of stuff that you only need to boil for, say, 10 minutes.",
  "translation": "您已经在利用抽象。 您怎么知道将意大利面煮多长时间？ 难道一个面食的面条和另一个面食的面条即使在同一盒中也有所不同吗？ 但是您可以通过抽象避免这些问题。 您不必担心面食的特定面条，但您可以像处理抽象的东西一样对待它，只需煮10分钟即可。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*rzjaCjoaZ3RaB_mN?q=20",
  "caption": "Photo by Christine Sandu on Unsplash",
  "type": "image",
  "file": "0!rzjaCjoaZ3RaB_mN"
}, {
  "tag": "P",
  "text": "As you go forward with your pasta making, you learn that there are yet other shapes. Maybe you boil those shapes differently, but you realise that they’re pretty interchangeable from a culinary point of view. In other words, if you have a recipe for bucatini all’amatriciana, and you have all the ingredients for the dish except you have spaghetti instead of bucatini, by the power of abstraction you can still make an excellent dish: spaghetti all’amatriciana.",
  "translation": "继续进行意大利面制作时，您会发现还有其他形状。 也许您煮这些形状的方式有所不同，但是您意识到从烹饪的角度来看它们可以互换。 换句话说，如果您有一份全美通心粉的食谱，并且除了义大利面而不是布加迪尼，就拥有这道菜的所有配料，通过抽象的力量，您仍然可以制作一道绝妙的菜肴：全美通心粉。"
}, {
  "tag": "P",
  "text": "It goes on: what if your all’amatriciana recipe calls for guanciale and you have none? You know that pancetta is pretty close, while tofu is not close at all. And on, and on. When you study cooking, you don’t even understand a recipe in terms of ingredients, you understand it in terms of roles. You identify the balance of sweet, salty, acid, fat, spiciness, umami, or other flavour categories. In other words, you understand a recipe abstractly. The abstract approach lets you identify solutions quickly.",
  "translation": "事情继续下去：如果您所有的amatriciana食谱都需要胍基尔而又没有，怎么办？ 您知道意大利薄饼很近，而豆腐根本就不近。 等等。 在学习烹饪时，您甚至不了解食谱中的食材，而是根据角色来理解。 您可以确定甜，咸，酸，脂肪，辣，鲜味或其他风味类别之间的平衡。 换句话说，您可以抽象地了解食谱。 抽象方法使您可以快速识别解决方案。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Andrew Zhuravchak的文章《Do we Need Math? Imagine our Life Without It》，参考：https://medium.com/swlh/do-we-need-math-imagine-our-life-without-it-c458fda152b3)",
  "translation": "（本文翻译自Andrew Zhuravchak的文章，《我们需要数学吗？想象一下没有它的生活》，参考：https：//medium.com/swlh/do-we-need-math-imagine-our-life-with-it-it -c458fda152b3）"
}]