[{
  "tag": "H1",
  "text": "Conclusion",
  "translation": "结论"
}, {
  "tag": "P",
  "text": "There is one last thing I want to tell you that is relevant for each of the above options:",
  "translation": "我要告诉您的最后一件事与上述每个选项有关："
}, {
  "tag": "P",
  "text": "Consistency is king.",
  "translation": "一致性为王。"
}, {
  "tag": "P",
  "text": "No matter what you start — pursue it, stick with it. Most things won’t work overnight. It is hard work, you have to invest time and energy. 99% give up too early. Be among the 1% that are successful!",
  "translation": "无论您从什么开始，都必须坚持下去。 大多数事情不会在一夜之间发挥作用。 这是艰苦的工作，您必须花费时间和精力。 99％的人放弃得太早。 跻身成功的1％之列！"
}, {
  "tag": "H1",
  "text": "Start a Podcast",
  "translation": "开始播客"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*d0Opd4tyhgcSrqEa?q=20",
  "caption": "Photo by Jonathan Farber on Unsplash",
  "type": "image",
  "file": "0!d0Opd4tyhgcSrqEa"
}, {
  "tag": "P",
  "text": "Many people don’t like it to be in front of a camera but are still experts in a field and would love to share their knowledge with others.",
  "translation": "许多人不喜欢它在镜头前，但仍然是该领域的专家，并希望与他人分享他们的知识。"
}, {
  "tag": "P",
  "text": "Podcasts are undoubtedly a great medium to do so. While they have been around for some time now, they have gained massively in popularity in the last four to five years, reaching millions of people that commute to work every day or listen to them before they go to bed.",
  "translation": "播客无疑是一个很好的媒介。 尽管他们已经存在了一段时间，但在过去的四到五年中，它们已经大受欢迎，吸引了成千上万的人每天上下班或上床睡觉。"
}, {
  "tag": "P",
  "text": "Now, most podcasts are free to listen to so money is more of a side-effect. A lot of podcasts have sponsors for their episodes that pay with services or money. Many podcasters are on Patreon, a platform where people can pay them a monthly amount to support their work and unlock exclusive content.",
  "translation": "现在，大多数播客都可以自由收听，因此金钱更多是一种副作用。 许多播客的节目赞助商都是用服务或金钱付费的。 许多播客都在Patreon上，该平台上的人们可以按月向他们付款以支持他们的工作并解锁专有内容。"
}, {
  "tag": "P",
  "text": "But in order to be successful with a podcast, you should be able to articulate yourself well, invest in some good gear (microphone), and most importantly, have the endurance to constantly record episodes.",
  "translation": "但是，为了成功播客，您应该能够很好地表达自己的观点，购买一些好的设备（麦克风），最重要的是，要有耐心不断录制情节。"
}, {
  "tag": "P",
  "text": "It’s not uncommon that people have to create weekly episodes for one or two years before they really see progress in terms of listeners.",
  "translation": "人们必须先制作一两年的每周情节，然后才能真正看到听众的进步，这种情况并不少见。"
}, {
  "tag": "P",
  "text": "So, it would be good if you are really passionate about this before doing it.",
  "translation": "因此，如果您在执行此操作之前真的对此充满热情，那就太好了。"
}, {
  "tag": "H1",
  "text": "Record and Sell Online Courses",
  "translation": "记录和出售在线课程"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*tz5GRryq5StZfrkW?q=20",
  "caption": "Photo by Avel Chuklanov on Unsplash",
  "type": "image",
  "file": "0!tz5GRryq5StZfrkW"
}, {
  "tag": "P",
  "text": "Being able to teach people online is one of the best things that emerged over the last decade and will be around for at least another decade if not longer, in my opinion.",
  "translation": "在我看来，能够在网上教人是过去十年来最好的事情之一，而且至少可以持续十年。"
}, {
  "tag": "P",
  "text": "The benefits for both students and teachers are massive. Students can choose from a wide range of offerings and learn on their own schedule. Teachers reach 1000s or 100,000s of people with their content.",
  "translation": "对学生和老师的好处都是巨大的。 学生可以从多种产品中进行选择，并按自己的时间表学习。 教师的内容可以触及1000或100,000的人。"
}, {
  "tag": "P",
  "text": "If you have experience with programming, ideally expert knowledge in a language like JavaScript or Python (or any other popular language or framework) or even in niche penetration testing and you are able to and have fun teaching others, creating online courses could be your thing.",
  "translation": "如果您具有编程经验，最好是具有JavaScript或Python（或任何其他流行语言或框架）之类的语言的专业知识，甚至是利基渗透测试，并且您能够并且乐于教别人，那么创建在线课程可能就是您的事 。"
}, {
  "tag": "P",
  "text": "There are many platforms available for your courses to be published on. Udemy, for example, has round about 75 million visitors a month and anyone can join them.",
  "translation": "有许多平台可用于发布您的课程。 例如，Udemy每月大约有7500万游客，任何人都可以加入。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*Nm92iQEjC_92aTq4CWFX4Q.png?q=20",
  "caption": "Udemy traffic overview",
  "type": "image",
  "file": "1!Nm92iQEjC_92aTq4CWFX4Q.png"
}, {
  "tag": "P",
  "text": "Other platforms like Frontend Masters or Pluralsight are invite-only but if you have a reputation or a good network — why not?",
  "translation": "其他平台（例如Frontend Masters或Pluralsight）仅应邀参加，但如果您有声誉或良好的网络，为什么呢？"
}, {
  "tag": "P",
  "text": "However, there are a few things to consider when recording your courses:",
  "translation": "但是，录制课程时需要注意以下几点："
}, {
  "tag": "UL",
  "texts": ["Invest in good gear: good microphone and webcam are a must!", "High-quality content is king. Competition is increasing steadily so you need to convince people that you can teach them valuable things.", "Practice speaking loud and clearly.", "Always rework your recordings.", "Create additional material like a GitHub project, presentations, coding examples …"],
  "translations": ["购买优质装备：必备麦克风和网络摄像头！", "高质量的内容为王。 竞争在稳步增长，因此您需要说服人们您可以教给他们有价值的东西。", "练习大声而清晰地讲话。", "务必重做您的录音。", "创建其他材料，例如GitHub项目，演示文稿，编码示例…"]
}, {
  "tag": "P",
  "text": "And even if it seems appealing that once a course has been recorded and people start buying it, it will create passive income for you, that is only true to some extent. The best teachers constantly update their courses because technology changes all the time!",
  "translation": "即使一门课程被记录下来并且人们开始购买它似乎很吸引人，它也会为您创造被动收入，但这在一定程度上是正确的。 最好的老师会不断更新他们的课程，因为技术一直在变化！"
}, {
  "tag": "H1",
  "text": "Start to Write",
  "translation": "开始写"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*E7Q3iyjc58358OsX?q=20",
  "caption": "Photo by Kaitlyn Baker on Unsplash",
  "type": "image",
  "file": "0!E7Q3iyjc58358OsX"
}, {
  "tag": "P",
  "text": "In my opinion, writing still is one of the best ways to reach a broad audience. There are plenty of opportunities for you to start writing and make money out of it:",
  "translation": "我认为，写作仍然是吸引广泛受众的最佳方法之一。 您有很多机会开始写作并从中赚钱："
}, {
  "tag": "UL",
  "texts": ["You can start your own blog and monetize with ad revenue.", "You can write books or ebooks and sell them online.", "You can write on platforms such as Medium and participate in their Partnership Programs.", "You can write guest posts for established sites like CSS-Tricks that will pay you a fixed amount if your article is accepted."],
  "translations": ["您可以创建自己的博客并通过广告收入获利。", "您可以编写书籍或电子书，然后在线销售。", "您可以在Medium等平台上撰写文章，并参与其合作伙伴计划。", "您可以为已建立的网站（如CSS-Tricks）撰写来宾帖子，如果您的文章被接受，则将向您支付固定金额。"]
}, {
  "tag": "P",
  "text": "There is nothing wrong with trying things out and seeing how people react to what you write.",
  "translation": "尝试并观察人们对您所写内容的反应并没有错。"
}, {
  "tag": "P",
  "text": "However, some things that you should consider are to choose a niche where you have a special interest in (keeps you motivated), to keep writing consistently (it takes time to get recognized), and to constantly improve your writing skills to deliver high-quality articles (people will thank you, there is more than enough low-quality stuff out there….).",
  "translation": "但是，您应该考虑的事情是选择对自己有特殊兴趣的利基市场（保持积极性），保持一致的写作（需要时间来获得认可），并不断提高写作技巧以实现更高的 高质量的文章（人们会感谢您，那里有足够多的低质量文章……）。"
}, {
  "tag": "H1",
  "text": "Participate in Coding Contests",
  "translation": "参加编码比赛"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*WZvXEWfZWA7ZYIgN?q=20",
  "caption": "Photo by Sean Do on Unsplash",
  "type": "image",
  "file": "0!WZvXEWfZWA7ZYIgN"
}, {
  "tag": "P",
  "text": "Yes, this is a real thing. There are dedicated platforms that organize programming contests for real prize money.",
  "translation": "是的，这是真实的东西。 有专门的平台可以组织编程竞赛，以获得真正的奖金。"
}, {
  "tag": "P",
  "text": "One of the biggest is Topcoder with more than a million members and a lot of competitions. They have three main focus areas: design, data science, and development.",
  "translation": "最大的公司之一是拥有超过一百万会员和众多比赛的Topcoder。 它们具有三个主要重点领域：设计，数据科学和开发。"
}, {
  "tag": "P",
  "text": "You would work on real projects initiated by more than 2000 companies or single matches against opponents. Fun is guaranteed, so is a fast learning curve.",
  "translation": "您将从事由2000多家公司发起的实际项目或与对手的一场比赛。 保证乐趣，快速学习也是如此。"
}, {
  "tag": "P",
  "text": "If you like challenges, this might be something for you. However, there is competition and you cannot count on a steady flow of income so make this one a lower priority.",
  "translation": "如果您喜欢挑战，这可能适合您。 但是，存在竞争，因此您不能指望稳定的收入流，因此请优先考虑这一点。"
}, {
  "tag": "H1",
  "text": "Start to Freelance",
  "translation": "开始自由职业"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*UeJUtDGUqA1FCpHV?q=20",
  "caption": "Photo by Brooke Cagle on Unsplash",
  "type": "image",
  "file": "0!UeJUtDGUqA1FCpHV"
}, {
  "tag": "P",
  "text": "Freelancing can be a great thing. No (real) boss, a tremendous amount of projects to choose from, high daily rates for specialists, as many holidays as you want…the list goes on.",
  "translation": "自由职业可能是一件好事。 没有（真正的）老板，可供选择的项目很多，专家的日租金高，您想要的假期多……列表还在继续。"
}, {
  "tag": "P",
  "text": "However, it requires a lot of discipline and effort to find clients and projects. The biggest advantage to me is that you can start freelancing next to your permanent job, be it in the evenings or on the weekends.",
  "translation": "但是，找到客户和项目需要大量的纪律和精力。 对我来说，最大的好处是您可以在晚上或周末在您的永久性工作旁边开始自由职业。"
}, {
  "tag": "P",
  "text": "Platforms like Upwork or Fiverr seem to offer a lot of opportunities especially for doing things on the sidelines but be aware of the competition over there.",
  "translation": "像Upwork或Fiverr这样的平台似乎提供了很多机会，尤其是在场边做事，但要意识到那里的竞争。"
}, {
  "tag": "P",
  "text": "Additionally, rates are pretty low so I would only recommend this if you just want to dip your toes into the water for the first time or are satisfied with only a little bit of additional income.",
  "translation": "此外，费率非常低，因此，如果您只是想第一次将脚趾伸入水中，或者仅对少量额外收入感到满意，我将不建议您这样做。"
}, {
  "tag": "P",
  "text": "A better strategy would be to work on your LinkedIn profile, contact recruiters and past clients from your network, go to conferences and meetups, and look out for platforms that match up remote workers with companies.",
  "translation": "更好的策略是使用您的LinkedIn个人资料，联系招聘人员和网络中的过往客户，参加会议和聚会，并寻找与远程工作人员与公司相匹配的平台。"
}, {
  "tag": "H1",
  "text": "How to Make Extra Money as a Programmer",
  "translation": "如何通过编程赚更多的钱"
}, {
  "tag": "H2",
  "text": "There are plenty of opportunities to expand your income beyond your day job",
  "translation": "有很多机会可以将收入扩展到日常工作之外"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*OCToFArfcpAo4JjUBzwytA.jpeg?q=20",
  "caption": "Photo by Alvaro Reyes on Unsplash",
  "type": "image",
  "file": "1!OCToFArfcpAo4JjUBzwytA.jpeg"
}, {
  "tag": "P",
  "text": "Being a programmer is a great thing. Not only is work fun most of the time, but there are plenty of job openings around and most of them pay very well.",
  "translation": "成为程序员是一件很棒的事。 不仅大多数时候工作都很有趣，而且周围有很多工作机会，而且大多数人的薪水都很高。"
}, {
  "tag": "P",
  "text": "But there are times when a little extra money on the side is much appreciated. Be it because you are still in college or university, you want to start to work for yourself rather than for others, you have a child and want to spend more time with them, you still need to make some cash or you’re doing it just for the fun of it.",
  "translation": "但是有时候，多花一些钱在旁是值得赞赏的。 是因为您仍在上大学，还是想开始为自己而不是别人工作，您有一个孩子并想花更多的时间陪伴他们，您仍然需要赚钱或在做 就是图个好玩儿。"
}, {
  "tag": "P",
  "text": "Here is the good thing: As a programmer, you have everything you need to increase the cash flow. Your brain, your laptop — that’s all you really need. Interested? Check out the following strategies and decide what fits best for you.",
  "translation": "这是一件好事：作为程序员，您拥有增加现金流量所需的一切。 您的大脑，您的笔记本电脑-这才是您真正需要的。 有兴趣吗 查看以下策略，并确定最适合您的策略。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Simon Holdorf的文章《How to Make Extra Money as a Programmer》，参考：https://medium.com/better-programming/how-to-make-extra-money-as-a-programmer-144d76b76ffd)"
}]